## Pandas
## Groupby
Groupby allows you tu group tigether rows based off of a column and perform an aggregate function on them

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'Company':['Goog','Goog','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vannesa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [5]:
df=pd.DataFrame(data)

In [6]:
df

  Company   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vannesa    124
4      FB     Carl    243
5      FB    Sarah    350

In [8]:
byComp=df.groupby('Company') # agrupamos

In [9]:
byComp

In [13]:
byComp.sum()

             Person  Sales
Company
FB        CarlSarah    593
Goog     SamCharlie    320
MSFT     AmyVannesa    464

In [15]:
byComp.mean('Sales')

         Sales
Company
FB       296.5
Goog     160.0
MSFT     232.0

In [19]:
byComp.sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [20]:
df.groupby('Company').sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [21]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
Goog          2      2
MSFT          2      2

In [23]:
df.groupby('Company').max() # ordena por person en orden alfabetico y Sales mayo

          Person  Sales
Company
FB         Sarah    350
Goog         Sam    200
MSFT     Vannesa    340

In [24]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
Goog     Charlie    120
MSFT         Amy    124

In [25]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [26]:
df.groupby('Company').describe().transpose()

Company              FB        Goog        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [28]:
df.groupby('Company').describe().transpose()[['FB']]

Company              FB
Sales count    2.000000
      mean   296.500000
      std     75.660426
      min    243.000000
      25%    269.750000
      50%    296.500000
      75%    323.250000
      max    350.000000